In [45]:
import pandas as pd

In [46]:
df = pd.read_csv("test.csv")

In [47]:
df

            col1          "col2"          "col3"
0  hello world 1   hello world 2   hello world 3
1              1             "2"             "3"
2              4             "5"             "6"

In [53]:
#colmap = {} # dictionary # key:val
array = []
for col_name in df.iloc[0] :
    #colmap.update({col_name : col_name[11:]})
    array.append(col_name[12:]) # regex str.search ("!")

In [55]:
array #col name

['1', ' 2', ' 3']

In [56]:
df2 = df.set_axis(array, axis=1, inplace=False)

In [57]:
df2

               1               2               3
0  hello world 1   hello world 2   hello world 3
1              1             "2"             "3"
2              4             "5"             "6"